package DesignModel.StrategyPattern;

/**
 * 策略模式的优点
 * ● 算法可以自由切换
 * 这是策略模式本身定义的， 只要实现抽象策略， 它就成为策略家族的一个成员， 通过封
 * 装角色对其进行封装， 保证对外提供“可自由切换”的策略。
 * ● 扩展性良好
 * 这甚至都不用说是它的优点， 因为它太明显了。 在现有的系统中增加一个策略太容易
 * 了， 只要实现接口就可以了， 其他都不用修改， 类似于一个可反复拆卸的插件， 这大大地符
 * 合了OCP原则。
 *
 * 策略模式的缺点
 * ● 策略类数量增多
 * 每一个策略都是一个类， 复用的可能性很小， 类数量增多。
 * ● 所有的策略类都需要对外暴露上层模块必须知道有哪些策略， 然后才能决定使用哪一个策略， 这与迪米特法则是相违
 * 背的， 我只是想使用了一个策略， 我凭什么就要了解这个策略呢？ 那要你的封装类还有什么
 * 意义？ 这是原装策略模式的一个缺点， 幸运的是， 我们可以使用其他模式来修正这个缺陷，
 * 如工厂方法模式、 代理模式或享元模式。
 *
 * 策略模式的使用场景
 * ● 多个类只有在算法或行为上稍有不同的场景。
 * ● 算法需要自由切换的场景。
 * 例如， 算法的选择是由使用者决定的， 或者算法始终在进化， 特别是一些站在技术前沿
 * 的行业， 连业务专家都无法给你保证这样的系统规则能够存在多长时间， 在这种情况下策略
 * 模式是你最好的助手。
 * ● 需要屏蔽算法规则的场景。
 * 现在的科技发展得很快， 人脑的记忆是有限的（就目前来说是有限的） ， 太多的算法你
 * 只要知道一个名字就可以了， 传递相关的数字进来， 反馈一个运算结果， 万事大吉。
 *
 * 策略模式的注意事项
 * 如果系统中的一个策略家族的具体策略数量超过4个， 则需要考虑使用混合模式(工厂模式+策略模式)， 解决
 * 策略类膨胀和对外暴露的问题， 否则日后的系统维护就会成为一个烫手山芋， 谁都不想接。
 *
 * 最佳实践
 * 策略模式是一个非常简单的模式。 它在项目中使用得非常多， 但它单独使用的地方就比
 * 较少了， 因为它有致命缺陷： 所有的策略都需要暴露出去， 这样才方便客户端决定使用哪一
 * 个策略。 例如， 在例子中的赵云， 实际上不知道使用哪个策略， 他只知道拆第一个锦囊， 而
 * 不知道是BackDoor这个妙计。 是的， 诸葛亮已经在规定了在适当的场景下拆开指定的锦囊，
 * 我们的策略模式只是实现了锦囊的管理， 但是我们没有严格地定义“适当的场景”拆开“适当
 * 的锦囊”， 在实际项目中， 我们一般通过工厂方法模式来实现策略类的声明， 读者可以参考
 * 混编模式。
 */
public class Client {
    public static void main(String[] args) {
        Strategy strategy1 = new ConcreteStrategy1();
        Context context = new Context(strategy1);
        context.doAnything();
    }
}
